#cal_r,load,cal_i,jal,mfhi  	需要写寄存器
#store,load,cal_i,cal_r,b, 		需要读寄存器

ori		$1, $0, 0x1200759a
sw		$1, 0($0)
ori		$1, $0, 0x350022ee
sw		$1, 4($0)
ori		$1, $0, 0xb4005878
sw		$1, 8($0)
ori		$1, $0, 0xb3605cfd
sw		$1, 12($0)
ori		$1, $0, 0xe1201a49
sw		$1, 16($0)
ori		$1, $0, 0xf3203bf6
sw		$1, 20($0)
ori		$1, $0, 0xa9e0797d
sw		$1, 24($0)
ori		$1, $0, 0xf4900ddc
sw		$1, 28($0)
ori		$1, $0, 0xcad0314f
sw		$1, 32($0)
ori		$1, $0, 0xe1404df2
sw		$1, 36($0)
ori		$1, $0, 0x94402e40
sw		$1, 40($0)
ori		$1, $0, 0x36801cd0
sw		$1, 44($0)
ori		$1, $0, 0x68b068c4
sw		$1, 48($0)
ori		$1, $0, 0x23007eb7
sw		$1, 52($0)
ori		$1, $0, 0x3202c3b
sw		$1, 56($0)
ori		$1, $0, 0x5a105422
sw		$1, 60($0)
ori		$1, $0, 0xef600822
sw		$1, 64($0)
ori		$1, $0, 0x9910409d
sw		$1, 68($0)
ori		$1, $0, 0x2e10798b
sw		$1, 72($0)
ori		$1, $0, 0x21f073da
sw		$1, 76($0)
ori		$1, $0, 0x8b0026ca
sw		$1, 80($0)
ori		$1, $0, 0x69900902
sw		$1, 84($0)
ori		$1, $0, 0xbb905772
sw		$1, 88($0)
ori		$1, $0, 0x39d07049
sw		$1, 92($0)
ori		$1, $0, 0x92c04a80
sw		$1, 96($0)
ori		$1, $0, 0x87e016c5
sw		$1, 100($0)
ori		$1, $0, 0x89903cd5
sw		$1, 104($0)
ori		$1, $0, 0x3e904080
sw		$1, 108($0)
ori		$1, $0, 0xdb2033ea
sw		$1, 112($0)
ori		$1, $0, 0x3c9048cc
sw		$1, 116($0)
ori		$1, $0, 0x753060bf
sw		$1, 120($0)
ori		$1, $0, 0xc6703cd6
sw		$1, 124($0)
ori		$1, $0, 0xfbf02f14
sw		$1, 128($0)
ori		$1, $0, 0xad60047e
sw		$1, 132($0)
ori		$1, $0, 0x22d054dc
sw		$1, 136($0)
ori		$1, $0, 0x68e00d68
sw		$1, 140($0)
ori		$1, $0, 0x983075ef
sw		$1, 144($0)
ori		$1, $0, 0x65702c49
sw		$1, 148($0)
ori		$1, $0, 0xc6102fff
sw		$1, 152($0)
ori		$1, $0, 0xc690288f
sw		$1, 156($0)
ori		$1, $0, 0xa61022cd
sw		$1, 160($0)
ori		$1, $0, 0xdd10261e
sw		$1, 164($0)
ori		$1, $0, 0xe9d0489c
sw		$1, 168($0)
ori		$1, $0, 0x91606172
sw		$1, 172($0)
ori		$1, $0, 0xb72032e6
sw		$1, 176($0)
ori		$1, $0, 0x1d071f0
sw		$1, 180($0)
ori		$1, $0, 0x38407f4f
sw		$1, 184($0)
ori		$1, $0, 0x94a00677
sw		$1, 188($0)
ori		$1, $0, 0x402018d7
sw		$1, 192($0)
ori		$1, $0, 0xbe805039
sw		$1, 196($0)
ori		$1, $0, 0x42c01953
sw		$1, 200($0)
ori		$1, $0, 0xbcb00fc9
sw		$1, 204($0)
ori		$1, $0, 0xe1205f1e
sw		$1, 208($0)
ori		$1, $0, 0x83307874
sw		$1, 212($0)
ori		$1, $0, 0x49e02b0c
sw		$1, 216($0)
ori		$1, $0, 0x1f405dd5
sw		$1, 220($0)
ori		$1, $0, 0xad405a9f
sw		$1, 224($0)
ori		$1, $0, 0xcd405fa4
sw		$1, 228($0)
ori		$1, $0, 0x590127e
sw		$1, 232($0)
ori		$1, $0, 0x35007cf
sw		$1, 236($0)
ori		$1, $0, 0x73206d22
sw		$1, 240($0)
ori		$1, $0, 0xaf400ecc
sw		$1, 244($0)
ori		$1, $0, 0x6cf001d3
sw		$1, 248($0)
ori		$1, $0, 0xe9003a2d
sw		$1, 252($0)
ori		$1, $0, 0x48057d3
sw		$1, 256($0)
ori		$1, $0, 0x58f00975
sw		$1, 260($0)
ori		$1, $0, 0x7e6019d9
sw		$1, 264($0)
ori		$1, $0, 0x91d0252a
sw		$1, 268($0)
ori		$1, $0, 0x7e501dc0
sw		$1, 272($0)
ori		$1, $0, 0x9f70442b
sw		$1, 276($0)
ori		$1, $0, 0x7801481
sw		$1, 280($0)
ori		$1, $0, 0x8707b44
sw		$1, 284($0)
ori		$1, $0, 0x90e0765f
sw		$1, 288($0)
ori		$1, $0, 0x85002b00
sw		$1, 292($0)
ori		$1, $0, 0x6d407f61
sw		$1, 296($0)
ori		$1, $0, 0xa8d07fbe
sw		$1, 300($0)
ori		$1, $0, 0xc7b05005
sw		$1, 304($0)
ori		$1, $0, 0xc1503807
sw		$1, 308($0)
ori		$1, $0, 0x73b00633
sw		$1, 312($0)
ori		$1, $0, 0x2820251f
sw		$1, 316($0)
ori		$1, $0, 0xd1806270
sw		$1, 320($0)
ori		$1, $0, 0x492019da
sw		$1, 324($0)
ori		$1, $0, 0x6404d54
sw		$1, 328($0)
ori		$1, $0, 0x9ce03bb1
sw		$1, 332($0)
ori		$1, $0, 0xc850513e
sw		$1, 336($0)
ori		$1, $0, 0xd6906a15
sw		$1, 340($0)
ori		$1, $0, 0xff805c46
sw		$1, 344($0)
ori		$1, $0, 0x86a03004
sw		$1, 348($0)
ori		$1, $0, 0x79605e73
sw		$1, 352($0)
ori		$1, $0, 0x70e073d9
sw		$1, 356($0)
ori		$1, $0, 0xf160182f
sw		$1, 360($0)
ori		$1, $0, 0xd6705968
sw		$1, 364($0)
ori		$1, $0, 0xad402cf7
sw		$1, 368($0)
ori		$1, $0, 0xf4a00a4a
sw		$1, 372($0)
ori		$1, $0, 0xed004e57
sw		$1, 376($0)
ori		$1, $0, 0xf6805876
sw		$1, 380($0)
ori		$1, $0, 0x6fa01316
sw		$1, 384($0)
ori		$1, $0, 0x9bb06f11
sw		$1, 388($0)
ori		$1, $0, 0x4ad04eae
sw		$1, 392($0)
ori		$1, $0, 0xd2400588
sw		$1, 396($0)

# lw
	ori  		$1,$0,4
	addu		$1,$1,$1
	lw		$1, 0($1)
	addu		$1,$1,$1

	ori  		$1,$0,4
	sll		$1, $1, 1
	lw 		$1, 4($1)
	sll		$1, $1, 1

	ori 	$1,$0,0x8
	mthi 	$1
	ori 	$1,$0,0x4
	mfhi 	$1
	lw 		$1, 4($1)
	mthi 	$1
	mfhi 	$4

	ori 	$1,$0,0x40
	lw 		$1, 4($1)
	ori 	$1,$0,0x40

	jal 	t1
	lw 		$31, -0x3600($31) #调整
	lw 		$31, 0($31) #调整
	
	t1:
	ori 	$2,$0,0x24 #adj
	ori 	$1,$0,0x30
	sw 	$2,0($1)
	lw 		$1,0($1)
	beq 	$1,$2,t2
	ori 	$1,$0,0x68
	ori 	$1,$0,0x77

	t2:
	lw 		$1,4($1)
	bgtz 	$1,t3
	ori 	$1,$0,0x68
	ori 	$1,$0,0x77
t3:
# sw
	addu		$1,$1,$1
	sw		$1, 4($1)

	sll		$1, $1, 1
	sw 		$1, 4($1)

	ori 	$1,$0,0x8
	mthi 	$1
	ori 	$1,$0,0x4
	mfhi 	$1
	sw 		$1, 4($1)
	

	ori 	$1,$0,0x40
	sw 		$1, 4($1)

	jal 	t4
	sw 		$31, -0x3600($31) #调整
	sw 		$31, -0x3600($31)
	
t4:
# jalr
	ori 	$2, $0, 0x370c#adj
	addu		$1,$2,$0
	jalr	$2, $1
	addu		$1,$2,$2
	addu		$1,$2,$2

jh1:
	ori 	$1, $0,0x6e40#adj
	srl		$1, $1,1
	jalr	$2, $1
	sll		$1, $2, 1
	sll		$1, $2, 1
jh2:
	ori 	$1,$0,0x373c
	mthi 	$1
	ori 	$1,$0,0x4
	mfhi 	$1
	jalr 	$2, $1#adj
	mthi 	$2
	mfhi 	$4

jh3:
	ori 	$1,$0,0x374c
	jalr 	$2, $1#adj
	ori 	$1,$1,0x40
	ori 	$1,$1,0x40
jh4:

# jal
	ori 	$2, $0, 0x3760#adj
	addu		$1,$2,$0
	jalr	$2, $1
	addu		$1,$2,$2
	addu		$1,$2,$2

jh5:
	ori 	$1, $0,0x3774#adj
	sll		$1, $1, 0
	jalr	$2, $1
	sll		$2, $2, 1
	sll		$2, $2, 1
jh6:
	ori 	$1,$0,0x3794
	mthi 	$1
	nop
	ori 	$1,$0,0x4
	mfhi 	$1
	jalr 	$2, $1#adj
	mthi 	$1
	mfhi 	$4

jh7:
	ori 	$1,$0,0x37a0
	jalr 	$2, $1#adj
	ori 	$2,$2,0x40
	ori 	$2,$2,0x36
jh8:
	ori 	$2,$0,0x666





	
